Revit 2027 API
ColorFillSchemeEntry.SetElementIdValue Method
 Sets new ElementId value of entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetElementIdValue(
	ElementId value
)
Public Sub SetElementIdValue (
	value As ElementId
)
public:
void SetElementIdValue(
	ElementId^ value
)
member SetElementIdValue :
        value : ElementId -> unit
Parameters
value ElementId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The entry has different storage type with ElementId.
Remarks
 You should only use this method if the StorageType property reports the type of the entry as a ElementId.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace